Ran Plan for project: `eks/eksd_apnortheast2/eksdapne2-tcjc` dir: `terraform/eks/eksd_apnortheast2/eksdapne2-tcjc` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-tcjc"
      + configuration_values        = jsonencode(
            {
              + nodeSelector = {
                  + capacity_type = "cpu_on_demand"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.30.0-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-tcjc"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_node_group.eks_node_group["ondemand_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eksdapne2-tcjc"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "cpu_on_demand"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-tcjc-ng-ondemand_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::533267446521:role/eks-eksdapne2-tcjc-ng"
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.7-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07d7a2eca6d9a39a0",
          + "subnet-0d870bda49c58cbdb",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-tcjc-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-tcjc" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-tcjc-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-tcjc" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-08e3ebeccb9639512"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["spot_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "eksdapne2-tcjc"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "spot"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-tcjc-ng-spot_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::533267446521:role/eks-eksdapne2-tcjc-ng"
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.7-20260209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07d7a2eca6d9a39a0",
          + "subnet-0d870bda49c58cbdb",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-tcjc-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-tcjc" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-tcjc-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-tcjc" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-08e3ebeccb9639512"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 5
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/eksd_apnortheast2/eksdapne2-tcjc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.overtake.live/lock?id=alpha3002025%252Feks-tf-provisioning%252Fterraform%252Feks%252Feksd_apnortheast2%252Feksdapne2-tcjc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/eksd_apnortheast2/eksdapne2-tcjc`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
